In [26]:
import pandas as pd

from sklearn.preprocessing import LabelEncoder
df=pd.read_csv("sample_data.csv")
df.head()

     Name  Gender       City Passed
0    Aman    Male      Delhi    Yes
1   Priya  Female     Mumbai    Yes
2   Rahul    Male  Bangalore     No
3  Anjali  Female     Mumbai    Yes
4    Ravi    Male      Delhi    Yes

In [27]:
le=LabelEncoder()

df["Gender"]=le.fit_transform(df["Gender"])

df.head()

     Name  Gender       City Passed
0    Aman       1      Delhi    Yes
1   Priya       0     Mumbai    Yes
2   Rahul       1  Bangalore     No
3  Anjali       0     Mumbai    Yes
4    Ravi       1      Delhi    Yes

In [28]:
df = pd.get_dummies(df, columns=["City"])

df.head()

,Name,Gender,Passed,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
0,Aman,1,Yes,False,False,True,False
1,Priya,0,Yes,False,False,False,True
2,Rahul,1,No,True,False,False,False
3,Anjali,0,Yes,False,False,False,True
4,Ravi,1,Yes,False,False,True,False

In [29]:
df["City_Bangalore"]=le.fit_transform(df["City_Bangalore"])
df["City_Chennai"]=le.fit_transform(df["City_Chennai"])
df["City_Mumbai"]=le.fit_transform(df["City_Mumbai"])
df["City_Delhi"]=le.fit_transform(df["City_Delhi"])
df.head()

,Name,Gender,Passed,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
0,Aman,1,Yes,0,0,1,0
1,Priya,0,Yes,0,0,0,1
2,Rahul,1,No,1,0,0,0
3,Anjali,0,Yes,0,0,0,1
4,Ravi,1,Yes,0,0,1,0

In [30]:
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            20 non-null     object
 1   Gender          20 non-null     int64
 2   Passed          20 non-null     object
 3   City_Bangalore  20 non-null     int64
 4   City_Chennai    20 non-null     int64
 5   City_Delhi      20 non-null     int64
 6   City_Mumbai     20 non-null     int64
dtypes: int64(5), object(2)
memory usage: 1.2+ KB

In [31]:
df["Marks"]=[85,90,78,92,88,76,95,89,84,91,87,90,93,77,82,88,85,79,94,81]
df.head()

,Name,Gender,Passed,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai,Marks
0,Aman,1,Yes,0,0,1,0,85
1,Priya,0,Yes,0,0,0,1,90
2,Rahul,1,No,1,0,0,0,78
3,Anjali,0,Yes,0,0,0,1,92
4,Ravi,1,Yes,0,0,1,0,88

In [ ]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
df["Marks"] = sc.fit_transform(df[["Marks"]])
df

,Name,Gender,Passed,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai,Marks
0,Aman,1,Yes,0,0,1,0,-0.211275
1,Priya,0,Yes,0,0,0,1,0.669039
2,Rahul,1,No,1,0,0,0,-1.443716
3,Anjali,0,Yes,0,0,0,1,1.021165
4,Ravi,1,Yes,0,0,1,0,0.316913
5,Meera,0,No,0,1,0,0,-1.795841
6,Arjun,1,Yes,1,0,0,0,1.549353
7,Neha,0,Yes,0,0,1,0,0.492976
8,Imran,1,No,0,1,0,0,-0.387338
9,Sneha,0,Yes,0,0,0,1,0.845102
10,Raj,1,Yes,0,1,0,0,0.140850
11,Divya,0,No,0,0,1,0,0.669039
12,Kabir,1,Yes,0,0,0,1,1.197228
13,Simran,0,Yes,1,0,0,0,-1.619779
14,Karan,1,No,0,0,1,0,-0.739464
15,Pooja,0,Yes,0,0,0,1,0.316913
16,Rakesh,1,Yes,0,1,0,0,-0.211275
17,Isha,0,No,0,0,1,0,-1.267653
18,Rohit,1,Yes,0,0,1,0,1.373291
19,Deepa,0,Yes,1,0,0,0,-0.915527